// =============================================================================
//
// Class : Form
//
// $Date: 2017-07-03 11:56:22 +0900 (Mon, 03 Jul 2017) $
// $Rev: 97 $
//
// =============================================================================
// -----------------------------------------------------------------------------
// Constructor
// -----------------------------------------------------------------------------
/**
 * @class
 * @classdesc Formクラス
 * @constructor
 */
function Form() {
	// -------------------------------------------------------------------------
	// Instance Member
	// -------------------------------------------------------------------------
	/**
	 * instMember
	 */
	this.instMember = "";

	// -------------------------------------------------------------------------
	// Process
	// -------------------------------------------------------------------------
}

// -----------------------------------------------------------------------------
// Class Member
// -----------------------------------------------------------------------------
/**
 * CURSOR_SELECTOR
 */
Form.CURSOR_SELECTOR = "*";

// -----------------------------------------------------------------------------
// Class Method
// -----------------------------------------------------------------------------

// -------------------------------------------------------------------------
// Form.cursorWaitAutoEnd
// -------------------------------------------------------------------------
/**
 * マウスカーソルを待ち状態に変更し、コールバック関数が終了次第自動でデフォルトに戻します
 */
Form.cursorWaitAutoEnd = function(callback) {
	Form.cursorWait(callback, true);
}

// -------------------------------------------------------------------------
// Form.cursorWaitNonAutoEnd
// -------------------------------------------------------------------------
/**
 * マウスカーソルを待ち状態に変更し、コールバック関数が終了後もデフォルトに戻しません
 */
Form.cursorWaitNonAutoEnd = function(callback) {
	Form.cursorWait(callback, false);
}

// -------------------------------------------------------------------------
// Form.cursorWait
// -------------------------------------------------------------------------
/**
 * マウスカーソルを待ち状態に変更します
 */
Form.cursorWait = function(callback, autoEnd) {

	Util.async(function() {
		$(Form.CURSOR_SELECTOR).css("cursor", "wait");

//		log.debug("Form.cursorWait()", "autoEnd=[" + autoEnd + "]");

		if (callback) {
			Util.async(function() {
				try {
					callback();
				} catch (e) {
					console.error(e);
				} finally {
					try {
						if (autoEnd || autoEnd === undefined) {
							Form.cursorDefault();
						}
					} finally {
					}
				}
			}, 50);
		}
	});
};

// -------------------------------------------------------------------------
// Form.cursorDefault
// -------------------------------------------------------------------------
/**
 * マウスカーソルをデフォルト状態に変更します
 */
Form.cursorDefault = function() {

	$(Form.CURSOR_SELECTOR).css("cursor", "");

//	log.debug("Form.cursorDefault()");
};

// -----------------------------------------------------------------------------
// Instance Property
// -----------------------------------------------------------------------------
Object.defineProperty(Form.prototype, "xxx", {
	get: function() {
		var inst = this;
		return inst.xxx_;
	},
	set: function(newValue) {
		var inst = this;
		this.xxx_ = newValue;
		inst = null;
	},
	enumerable: true,
	configurable: true,
});

// -----------------------------------------------------------------------------
// Instance Method
// -----------------------------------------------------------------------------
/**
 * instMethod
 */
Form.prototype.instMethod = function() {
};
